Tekla Open API Reference for Tekla Structures 2025
StringList.ToArray Method
 Copies the strings to a string array.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string[] ToArray()
Public Function ToArray As String()
Return Value
Type: String[]
The array of strings.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace